[
  {
    "id": "1",
    "title": "New Partnership with Ethiopian Universities",
    "excerpt": "We're excited to announce partnerships with leading Ethiopian universities to provide accredited online courses and knowledge sharing programs.",
    "content": "GrowNet is proud to announce strategic partnerships with five leading Ethiopian universities including Addis Ababa University, Bahir Dar University, and Hawassa University. These partnerships will enable us to offer accredited online courses, facilitate knowledge sharing between students and faculty, and provide pathways for continuing education. The collaboration will focus on developing culturally relevant content that addresses the specific needs of Ethiopian learners while maintaining international standards of education quality.",
    "category": "Partnership",
    "author_id": "admin1",
    "author_name": "GrowNet Team",
    "thumbnail_url": "/images/university-partnership.jpg",
    "tags": ["partnership", "universities", "education", "accreditation"],
    "is_published": true,
    "is_featured": true,
    "views": 2847,
    "likes": 156,
    "created_at": "2025-01-15T08:00:00Z",
    "updated_at": null,
    "published_at": "2025-01-15T08:00:00Z"
  },
  {
    "id": "2",
    "title": "Mobile App Launch Coming Soon",
    "excerpt": "Learn on the go with our upcoming mobile application, designed specifically for Ethiopian learners with offline learning capabilities.",
    "content": "We're thrilled to announce that the GrowNet mobile application will be launching next month! The app has been designed with Ethiopian learners in mind, featuring offline learning capabilities to accommodate areas with limited internet connectivity. Key features include downloadable courses, offline note-taking, progress tracking, and community forums. The app will be available for both Android and iOS platforms, with special optimization for popular Ethiopian smartphone models. Beta testing is currently underway with selected community members.",
    "category": "Product Update",
    "author_id": "admin1",
    "author_name": "GrowNet Team",
    "thumbnail_url": "/images/mobile-app.jpg",
    "tags": ["mobile app", "offline learning", "technology", "accessibility"],
    "is_published": true,
    "is_featured": true,
    "views": 1923,
    "likes": 89,
    "created_at": "2025-01-10T12:30:00Z",
    "updated_at": null,
    "published_at": "2025-01-10T12:30:00Z"
  },
  {
    "id": "3",
    "title": "Community Knowledge Hub Launched",
    "excerpt": "Introducing our new community-driven knowledge sharing platform where learners can contribute and access peer-generated content.",
    "content": "Today marks the launch of our Community Knowledge Hub, a revolutionary platform that empowers Ethiopian learners to share their expertise and learn from each other. The hub features user-generated content, peer review systems, and collaborative learning spaces. Community members can now create and share tutorials, cultural insights, local business knowledge, and academic resources. The platform includes moderation tools to ensure quality content and recognition systems to reward valuable contributors. This initiative aligns with our mission to democratize education and celebrate Ethiopian knowledge traditions.",
    "category": "Education",
    "author_id": "admin1",
    "author_name": "GrowNet Team",
    "thumbnail_url": "/images/knowledge-hub.jpg",
    "tags": ["community", "knowledge sharing", "peer learning", "collaboration"],
    "is_published": true,
    "is_featured": false,
    "views": 1456,
    "likes": 67,
    "created_at": "2025-01-05T15:45:00Z",
    "updated_at": null,
    "published_at": "2025-01-05T15:45:00Z"
  },
  {
    "id": "4",
    "title": "Success Story: From Student to Entrepreneur",
    "excerpt": "Meet Hanan Mohammed, who used GrowNet courses to launch her successful tech startup in Addis Ababa.",
    "content": "We're proud to share the inspiring story of Hanan Mohammed, a GrowNet learner who transformed her career through our platform. Starting as a university student with limited programming knowledge, Hanan completed multiple courses on our platform including web development, business fundamentals, and entrepreneurship. Today, she runs a successful tech startup in Addis Ababa that employs 15 people and serves clients across East Africa. 'GrowNet gave me the confidence and skills I needed to pursue my dreams,' says Hanan. 'The community support and practical courses made all the difference.' Her company now partners with GrowNet to provide internship opportunities for other learners.",
    "category": "Success Story",
    "author_id": "admin2",
    "author_name": "Editorial Team",
    "thumbnail_url": "/images/success-story.jpg",
    "tags": ["success story", "entrepreneurship", "technology", "inspiration"],
    "is_published": true,
    "is_featured": false,
    "views": 987,
    "likes": 45,
    "created_at": "2025-01-01T10:00:00Z",
    "updated_at": null,
    "published_at": "2025-01-01T10:00:00Z"
  }
]
